const bounds = [
  [45.5, 46.5],  // Юго-западная граница (ещё левее)
  [49.5, 56.0]   // Северо-восточная граница (ещё правее)
];

const map = L.map('map', {
  center: [47.5, 52.5], // Центр карты на Атырау
  zoom: 7,
  minZoom: 7,
  maxBounds: bounds,
  maxBoundsViscosity: 1.0
});

// Подключение OpenStreetMap
L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
  attribution: '&copy; OpenStreetMap contributors'
}).addTo(map);

// Список топонимов с точными координатами
const locations = [
  { name: "Каспийское море", coords: [46.53799773173459, 51.519102284266985], meaning: "От персидского 'Место коней'" },
  { name: "река Жайык", coords: [47.11815834032906, 51.92026047208328], meaning: "старое название Яик(от тюрк. ‘высший бог’, ‘творец’)" },
  { name: "озеро Жиреньколь", coords: [50.76480778497723, 54.801188769467004], meaning: "каз. Жирен – ‘рыжийч’, кол (каз. көл – ‘озеро’)" },
  { name: "река Сагиз", coords: [48.232444103032286, 54.88293152796897], meaning: "тюрк. ‘сростки кристаллов соли’" },
  { name: "река Кичаг", coords: [46.74221337732942, 48.628592540911725], meaning: "каз.Кигáш-‘кривой’, ‘загнутый’, ‘изогнутый’" },
  { name: "река Илек", coords: [51.72291236859214, 53.39674276724387], meaning: "каз. Елек – ‘решето’, ‘сито’" },
  { name: "река Уил", coords: [48.613042476544216, 52.413648321690964], meaning: "каз. Ойыл - ‘нефть’" },
  { name: "озеро Индер", coords: [48.49985796846053, 51.91291589164033], meaning: "каз. Индербор - ‘мел’" },
  { name: "река Эмба", coords: [47.07270174008425, 55.04914347137451], meaning: "каз. Жем – ‘пропитание’" },
  { name: "город Атырау", coords: [47.09562116413034, 51.9191234495532], meaning: "знач.’ устье реки’" },
  { name: "село Ақжайық", coords: [47.06876588678999, 51.87321043366877], meaning: "каз. Ақ – ‘белый’, жайық – ‘река Урал’" },
  { name: "город Кульсары", coords: [46.96255091470504, 54.01307981474327], meaning: "посвящена Кульсары Тинекейулы" },
  { name: "район Курмангазы", coords: [47.54894143249952, 48.922924083237966], meaning: "посвящена Курмангазы Сагырбайулы" },
  { name: "район Махамбет", coords: [47.67678000681049, 51.71424706948621], meaning: "посвящена Махамбе́т Утеми́сулы" },
  { name: "район Исатай", coords: [46.79707660138262, 50.0677443077779], meaning: "посвящена Исатай Тайманулы" },
  { name: "район Индер", coords: [48.63833663515119, 51.4831910045894] , meaning: "каз. Индербор – ‘мел’"},
  { name: "село Байчунас", coords: [47.24092407144931, 52.93913783543513], meaning: "каз. Байшонас -  ‘нефтяное месторождение’" },
  { name: "село Аккистау", coords: [47.22040201586229, 51.00694595500151], meaning: "каз. Аққыстау; Ақ – ‘белый’, қыстау – ‘зимовать’,‘проводить зиму’" },
  { name: "село Миялы", coords: [48.88412895727724, 53.794812897481684], meaning: "каз. ‘местность, где много растет солодки’" },
  { name: "село Аккайын", coords: [47.42135398831659, 51.83204017487015], meaning: "каз. Аққайың;  ақ - белый, қайың – береза" },
  { name: "село Кошкар", coords: [47.4321801403823, 53.446811526350366], meaning: "каз. Қошқар – ‘баран’)" },
  { name: "село Жыланды", coords: [46.620946034137425, 48.6444846070973], meaning: "каз. Жыланды – ‘змеиний, со змеями’" },
  { name: "посёлок Балыкши", coords: [47.08441851970366, 51.878385197111854], meaning: "каз. Балықшы – ‘рыбак’, ‘рыболов’" },
  { name: "район Жылыой", coords: [46.76967699693299, 54.26289405862465], meaning: "каз. Жылыой; жылы – ‘теплый’, ой – ‘впадина’, ‘низина, ‘долина‘" },
  { name: "район Кызылкога", coords: [48.38084482963372, 53.8199179136008], meaning: "қызыл - ‘красный’, қоға - ‘рогоз’" },
  { name: "село Кызылжар", coords: [48.206263858940105, 51.595830867859306], meaning: "Қызылжар - ‘красный овраг’" },
  { name: "район Химпоселок", coords: [47.092412444334705, 51.94130874241918], meaning: "'химический поселок'" },
  { name: "город Сарайчик", coords: [47.50039899381784, 51.7194054433137], meaning: "От персидского ‘дворец’)" },
  { name: "район Макат", coords: [47.644391452692695, 53.331884456856365], meaning: "каз. Мақат – ‘душа’, ‘дух’" },
  { name: "село Искене", coords: [47.22596536159137, 52.66903636706324], meaning: "каз. Ескене – ‘сознание’, ‘дух’, ‘разум’, ‘ум’" },
  { name: "село Махамбет", coords: [47.67125732319936, 51.586174161717686], meaning: "посвящена Махамбе́т Утеми́сулы " },
  { name: "посёлок Доссор", coords: [47.52402729496593, 52.981352077712444], meaning: "каз. Доссор; дос – ‘друг’, сор – ‘солончак’, ‘засолённая местность’" },
  { name: "Рын-пески", coords: [47.33356819464468, 48.880091049761155], meaning: "каз. Нарын құмы — ‘узкий песок’" },
  { name: "Бузанай", coords: [47.58803506679143, 50.179686115190854], meaning: "" },
  { name: "Ментеке", coords: [47.07, 50.42], meaning: "" },
  { name: "Гора Желтау", coords: [46.96255091470504, 54.01307981474327], meaning: "каз. Желтау; жел – ‘ветер’, тау – ‘гора’) " },
  { name: "Мост Алиева", coords: [47.11746090196577, 51.9210756390379], meaning: "посвящени Алиеву" },
  { name: "Центральный мост", coords: [47.10530653079645, 51.91967067815934], meaning: "посвящен" },
  { name: "Жилгородок", coords: [47.09814809092486, 51.89373083727956], meaning: "(‘жилой комплекс, поселок для работников строящегося предприятия’" },
  { name: "Мост Балыкши", coords: [47.07998659163784, 51.87183895262074], meaning: "каз. Балықшы – ‘рыбак’, ‘рыболов’" },
  { name: "Мост Мечников", coords: [47.12859465417639, 51.924506096709074], meaning: "посвящени Ильи Мечникова" }
];

locations.forEach(location => {
  L.marker(location.coords).addTo(map)
    .bindPopup(`<b>${location.name}</b><br>${location.meaning}`);
});
